Revit 2027 API
BuiltInFailures.StairRampFailures.WinderParallelTreadsNumberFailure Property
 Cannot satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderParallelTreadsNumberFailure { get; }
Public Shared ReadOnly Property WinderParallelTreadsNumberFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderParallelTreadsNumberFailure {
	FailureDefinitionId^ get ();
}
static member WinderParallelTreadsNumberFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace